---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForKeySchedule
zh: 明细表
source: html/84bd09c5-00dc-2238-1bd4-562e22dbbea5.htm
---
# Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForKeySchedule Method

**中文**: 明细表

Gets a list of categories that can be used for a key schedule.

## Syntax (C#)
```csharp
public static ICollection<ElementId> GetValidCategoriesForKeySchedule()
```

## Returns
The IDs of all valid categories.